---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterStringRuleEvaluator
source: html/87d580d0-ac0e-5a3c-783e-6869ab0413f8.htm
---
# FilterStringRuleEvaluator Properties

Specifies whether the .NET object represents a valid Revit entity.